{
    "List of Awards by IEEE NITK": [
        
        {
            "title": "Host Institute for IEEE Mangalore Subsection flagship events - I2CONECCT 2022 & PhD Colloquium 2024",
            "details": "2022, 2024"
        },
        
        {
            "title": "Host Institute for ICRAIE",
            "details": "2022"
        },
        
        {
            "title": "COVID-19 Awareness Task Force, a team from IEEE NITK Student Branch, won the IEEE R10 2021 Special Call for Proposals Related to COVID-19 grant",
            "details": "2021"
        },
        
        {
            "title": "Outstanding Student Branch Website, IEEE Bangalore Section",
            "details": "2021"
        },

        {
            "title": "Outstanding Large Student Branch, IEEE Bangalore Section",
            "details": "2020  "
        },

        {
            "title": " Exemplary Student Branch Award ",
            "details": "2007, 2013, 2015"
        },

        {
            "title": "IEEE R10 Exemplary Student Branch Award",
            "details": "2006, 2013, 2015, 2019"
        },

        {
            "title": "Silver Medal, The Darrel Chong Student Activity Award",
            "details": "2014"
        },
        {
            "title": "IEEE Darrel Chong Student Activity Award (Bronze) - Envision",
            "details": "2019"
        },
        {
            "title": "The Darrel Chong Student Activity Award (Bronze) - For the Open Collaborative Learning Project",
            "details": "2015"
        },
        {
            "title": "IEEE R10 Darrel Chong Student Activity Award (Silver), for Interactive Environment Educational Platform",
            "details": "2013"
        },
        {
            "title": "IEEE Mangalore Subsection Outstanding Student Branch",
            "details": "2019"
        },
        {
            "title": "IEEE Bangalore - Best Large Student Branch Award",
            "details": "2017"
        },
        {
            "title": "IEEE Student Ethics Competition conducted by the IEEE Ethics and Member Conduct Committee (EMCC) during SYWLC'19 at BITM - 2nd Place",
            "details": "2019"
        },
        {
            "title": "R10 IEEE GINI Student Branch Award",
            "details": "2010"
        },
        {
            "title": "EPICS project was adjudged 11th in the international IEEE Presidents change the world competition",
            "details": "2011"
        },
        {
            "title": "Organizers of Student Leadership Congress",
            "details": "2010"
        }

    ],

    "List of Achievements by IEEE NITK Members": [

        {
            "title": "Chandravaran Kunjeti was one of the authors of Dynamic Mirror Descent based Model Predictive Control for Accelerating Robot Learning, published in ICRA 2022",
            "details": "2022"
        },
        
        {
            "title": "Ameya Deshpande was one of the authors of IPv6 Performance and Diagnostic Metrics Version 2 (PDMv2) Destination Option, published in Internet Engineering Task Force (IETF)",
            "details": "2022"
        },
        
        {
            "title": "Adharsh Kamath was one of the authors of Certified Mergeable Replicated Data Types, published in PLDI 2022",
            "details": "2022"
        },

        {
            "title": "IEEE R10 Undergraduate Project Video Contest - Rakshit P, Pratham Nayak, Suresh Kamediya, Swetha Mary Thomas, Akheel Muhammed, Mehul Todi, Rohan Kamat",
            "details": "2022"
        },
        
        {
            "title": "Outstanding Young Professionals Volunteer, IEEE Bangalore Section - Prof. Mohit P. Tahiliani",
            "details": " 2020 "
        },

        {
            "title": "1 team in the Top 50, 3 in the Top 100 and 4 in the Top 150 at IEEEXtreme",
            "details": " 2020 "
        },

        {
            "title": "Top 3 spots at the IEEEXtreme Mock Coding Contest conducted by IEEE R10 SAC",
            "details": " 2020 "
        },

        {
            "title": "IEEE Outstanding Large Student Branch Counselor - Prof. MS Bhat",
            "details": "2019"
        },

        {
            "title": "IEEE R10 Outstanding Branch Counselor - Dr. Sumam David S",
            "details": "2013"
        },

        {
            "title": "IEEE Bangalore Section Humanitarian Activities Grant - Chandravaran K, Aditya C, Gayatri Y, Saikumar D",
            "details": ""
        },
        {
            "title": "IEEE Xtreme 2nd in India, and 17th Global",
            "details": "2019"
        },
        {
            "title": "IEEE Bangalore Outstanding Student Volunteer Award - Samarth Bonthala, Rosa George",
            "details": "2019, 2020"
        },
        {
            "title": "2015 IEEE Student Enterprise Award - 'Mapping of Greenhouse Gases using Wireless Sensor Networks'",
            "details": ""
        },
        {
            "title": "R10 Outstanding Branch Counselor & Advisor: Dr. Sumam David",
            "details": "2013"
        },
        {
            "title": "R10 IEEE Regional Student Enterprise Award - Quadcopter Project",
            "details": "2012"
        }
    ],

    "List of Achievements by CAS IEEE NITK": [

        {
            "title": "CAS Bangalore Outstanding Faculty Advisor - Prof. BV Perumal",
            "details": "2021"
        },
        
        {
            "title": "CAS Bangalore Outstanding Student Branch Chapter",
            "details": "2021"
        },
        
        {
            "title": "CAS Outstanding Large Student Branch Chapter Faculty Advisor, IEEE Bangalore Section - Prof. BV Perumal",
            "details": "2020"
        },

        {
            "title": "CAS Outstanding Large Student Branch Chapter, IEEE Bangalore Section",
            "details": "2020"
        },

        {
            "title": " Quadcopter project ",
            "details": "Awarded prestigious IEEE student enterprise award"
        },

        {
            "title": "Remotely Controlled Efficient Lighting",
            "details": "Won the 1st Position in Lighting Design track in the Electronics For You (EFY) Design Contest"
        },

        {
            "title": "Smart Lighting",
            "details": "Won TI ADC"
        },
        {
            "title": "Research paper titled ‘Timbre modelling of pitched musical instruments from an analysis synthesis perspective",
            "details": "IEEE student members won the Best Paper Award at the IEEE BRV Vardhan Conference 2013"
        },
        {
            "title": "Music transcription in Carnatic Music through classification of Gamaka",
            "details": "Ppresented at Midwest Music Information Retrieval Gathering June 14, 2014 - Evanston, IL"
        }
    ],


    "List of Achievements by Compsoc IEEE NITK": [

        {
            "title": "A Mobile Application for Women’s Safety: WoSApp",
            "details": "Accepted for presentation at the IEEE TENCON 2015, Macau"
        },

        {
            "title": "Interactive Environment Education Platform (IEEP)",
            "details": "The Darrel Chong Student Activity Award – Silver. IEEP was ranked among top 10 projects in IBM-IEEE Smarter Planet Contest. Deployed in 47 countries"
        },

        {
            "title": "Project Jagriti: Crowd sourced Child Abuse Reporting",
            "details": "Accepted for presentation at the Global Humanitarian Technology Conference 2014, Silicon Valley, USA"
        }
    ],

    "List of Achievements by SPS IEEE NITK": [

        {
            "title": "Impulse 2022, our SPS Hackathon scheduled in January 2022, won the IEEE SPS Member Driven Initiative grant",
            "details": "2022"
        }
    ]
}