[   {
    "title": "Improving Dynamic TDMA for Wireless Sensor Networks",
    "url" : "https://ieeexplore.ieee.org/document/10306566",
    "abstract": "2023 14th International Conference on Computing Communication and Networking Technologies (ICCCNT) - Bharadwaja M Chittapragada, Rohit Kumar, Violina Doley, B. R. Chandavarkar"
    },
    {
        "title": "Predictive Selective Repeat - an Optimized Selective Repeat for Noisy Channels",
        "url" : "https://ieeexplore.ieee.org/document/10308035",
        "abstract": "2023 14th International Conference on Computing Communication and Networking Technologies (ICCCNT) - Praveen Kumar P, Rati Preethi S, Shriya Anil, B. R. Chandavarkar"
    },
    {
        "title": "Communication Architecture for Autonomous Aerial Traffic Management",
        "url" : "https://ieeexplore.ieee.org/document/10054266",
        "abstract": "2022 IEEE 7th International Conference on Recent Advances and Innovations in Engineering (ICRAIE) - Shobuj Paul, Shuvrangshu Jana, Onkar Chopra, Ashwini Ratnoo, Debasish Ghose"
    },
    {
        "title": "An Enhancer-Driven Stem Cell-Like Program Mediated by SOX9 Blocks Intestinal Differentiation in Colorectal Cancer",
        "url" : "https://pubmed.ncbi.nlm.nih.gov/34571027/",
        "abstract": "Volume 162, Issue 1, Gastroenterology, Xiaoyan Liang, Gina N. Duronio, Yaying Yang, Pratyusha Bala, Prajna Hebbar, Sandor Spisak, Pranshu Sahgal, Harshabad Singh, Yanxi Zhang, Yingtian Xie, Paloma Cejas, Henry W. Long, Adam J. Bass, Nilay S. Sethi"
    },
    {
        "title": "Dynamic Mirror Descent based Model Predictive Control for Accelerating Robot Learning",
        "url" : "https://www.researchgate.net/publication/356816931_Dynamic_Mirror_Descent_based_Model_Predictive_Control_for_Accelerating_Robot_Learning",
        "abstract": "2022 39th International Conference on Robotics and Automation, Utkarsh A. Mishra, Soumya R. Samineni, Prakhar Goel, Chandravaran Kunjeti, Himanshu Lodha, Aman Singh, Aditya Sagi, Shalabh Bhatnagar, Shishir Kolathaya"
    },
    {
        "title": "Certified Mergeable Replicated Data Types",
        "url" : "https://arxiv.org/abs/2203.14518",
        "abstract": "2022 43rd Conference on Programming Language Design and Implementation, Vimala Soundarapandian, Adharsh Kamath, Kartik Nagar, KC Sivaramakrishnan"
    },
    {
        "title": "Distributed Adaptive Video Streaming using Inter-Server Data Distribution and Agent-based Adaptive Load Balancing",
        "url" : "https://ieeexplore.ieee.org/document/9183467",
        "abstract": "2020 16th International Conference on Distributed Computing in Sensor Systems (DCOSS), 2020, pp. 273-280, M. Bhowmik, A. Raghunandan and B. Rudra"
    },

    {
        "title": "Design and Analysis of Single SiC MOSFET Switch Flyback Converter based Control Power Supply for Renewable Applications",
        "url" : "https://ieeexplore.ieee.org/document/9362348",
        "abstract": "2020 International Conference on Power, Instrumentation, Control and Computing (PICC), 2020, pp. 1-5, S. Jagannath, N. Agarwal, S. Balasubramaniasarma, K. W. Ma and V. B"
    },

    {
        "title": "Trimodal Attention Module for Multimodal Sentiment Analysis (Student Abstract).",
        "url" : "https://www.researchgate.net/publication/342544446_Trimodal_Attention_Module_for_Multimodal_Sentiment_Analysis_Student_Abstract",
        "abstract": "Proceedings of the AAAI Conference on Artificial Intelligence. Vol. 34. No. 10. 2020 - Anirudh B H and Fatiha Sadat"
    },

    {
        "title": "Simulation study of multilayer hybrid plasmonic switch using Franz–Keldysh effect",
        "url" : "https://www.researchgate.net/publication/340680350_Simulation_study_of_multilayer_hybrid_plasmonic_switch_using_Franz-Keldysh_effect",
        "abstract": "Optical Engineering 59(4), 040501 - Santosh Kumar Sahu, Rohit Khoja, Sumit Kanu, Aman Kumar, and Mandeep Singh"
    },

    {
        "title": "A Hybrid Graph Coloring Algorithm for GPUs",
        "url" : "https://arxiv.org/abs/1912.01478",
        "abstract": "12th HIPC Student Research Symposium - Shanthanu S Rai, Rohit M P and Sreepathi Pai"
    },

    {
        "title": "Modelling and analysis of lower metal on-chip interconnect using physical fabrication parameters",
        "url" : "https://ieeexplore.ieee.org/document/9002436",
        "abstract": "IEEE-iSES, 2019 - Aditya Kulkarni, Iteesha V A and Sahith S R"
    },

    {
        "title": "Resource Provisioning Framework for IoT Applications in Fog Computing Environment",
        "url" : "https://ieeexplore.ieee.org/abstract/document/8710172",
        "abstract": "12th IEEE International Conference on Advanced Networks and Telecommunications Systems (ANTS) 2018 - Rakshith G"
    },

    {
        "title": "Solar PV Interface to Grid-Tie Inverter with Current Referenced Boost converter",
        "url" : "https://ieeexplore.ieee.org/document/8721313",
        "abstract": "13th International IEEE Conference for Industrial and Information Systems (ICIIS 2018)at IIT Ropar - Shama G Vasisht"
    },

    {
        "title": "Kinect Based Suspicious Posture Recognition for Real-Time Home Security Applications",
        "url" : "https://ieeexplore.ieee.org/document/8987184",
        "abstract": "15th IEEE India Council International Conference (INDICON) 2018 - Aditya Anantharaman"
    },

    {
        "title": "SolveIt : An application for Automated Recognition and Processing of Handwritten Mathematical equations",
        "url" : "https://ieeexplore.ieee.org/document/9058273",
        "abstract": "IEEE 4th International conference for Convergence in Technology (I2CT 2018) - Sagar Bharadwaj KS, Vilas Bhat, Arvind Sai Krishnan"
    },

    {
        "title": "Improved Transfer Learning through Shallow Network Embedding for Classification of Leukemia Cells",
        "url" : "https://ieeexplore.ieee.org/document/8593186",
        "abstract": "9th International Conference on Advances in Pattern Recognition (ICAPR-2017), ISI-Bangalore, 2017 - Kaushik S Kalmady"
    },

    {
        "title": "Damage identification and assessment using image processing on post-disaster satellite imagery",
        "url" : "https://ieeexplore.ieee.org/abstract/document/8239286",
        "abstract": "GHTC 2017 - Isha Tarte "
    },

    {
        "title": "Implementation and validation of random exponential marking (REM) in NS-3",
        "url" : "https://ieeexplore.ieee.org/document/8384131",
        "abstract": " ANTS 2017 - Isha Tarte"
    },

    {
        "title": "A Modular Two-Stage DC-Three Phase Converter",
        "url" : "https://ieeexplore.ieee.org/document/8557512",
        "abstract": "IEEE Energy Conversion Congress & Expo - Maitreyee Marathe"
    },

    {
        "title": "Corona Treated Polymeric Insulating Samples Subjected to Electrical and Mechanical Stresses",
        "url" : "",
        "abstract": "18th Asian Conference on Electrical Discharge -  Maitreyee Marathe"
    },

    {
        "title": "Corona Studies on Polymeric Insulator Samples used in High Voltage Transmission",
        "url" : "https://ieeexplore.ieee.org/document/8009109",
        "abstract": " IEEE WIECON-ECE - Maitreyee Marathe"
    },

    {
        "title": "Automated Evaluation of Attendance and Cumulative Feedback using Face Recognition",
        "url" : "",
        "abstract": "Proceedings of the 12th INDIACom; INDIACom-2018; IEEE Conference ID: 42835, 5th International Conference on “Computing for Sustainable Global Development” - Sheetal Shalini"
    },

    {
        "title": "Modeling of Human Face Expressions and Hand Movement for Animation",
        "url" : "",
        "abstract": "Proceedings of the 12th INDIACom; IEEE Conference ID: 42835 2018 5th International Conference on “Computing for Sustainable Global Development” - Sangeetha G S"
    },

    {
        "title": "Eyeball gesture controlled automatic wheelchair using deep learning",
        "url" : "https://ieeexplore.ieee.org/abstract/document/8288981",
        "abstract": "2017 IEEE Region 10 Humanitarian Technology Conference - Adarsh Rajesh, Megha Mantur"
    },

    {
        "title": "Medical Image Retrieval Using Manifold Ranking with Relevance Feedback",
        "url" : "https://ieeexplore.ieee.org/document/8334498",
        "abstract": "12th IEEE International Conference on Semantic Computing - Pooja Soundalgekar"
    },

    {
        "title": "Parallelization of Alpha-Beta Pruning Algorithm for enhancing the two player games",
        "url" : "https://www.iraj.in/journal/journal_file/journal_pdf/12-344-149191271477-84.pdf",
        "abstract": "International Journal of Advances in Electronics and Computer Science, Feb 2017 - Akanksha Kumari"
    },

    {
        "title": "Travel Recommendation System Using Geotagged Photos",
        "url" : "https://dl.acm.org/doi/10.1145/3154979.3154995",
        "abstract": "(ICCCT-2017) Proceedings of the 7th International Conference on Computer and Communication Technology - Akanksha Kumari"
    }
]
