[
	{
		"Title": "Arcade Game Solver",
		"Abstract": "Arcade Game Solver using Deep Reinforcement Learning was about building game agents that use reinforcement learning to play arcade games and hence learn optimal behaviour. It included working with Deep Learning and Convolutional Neural Networks in Python.",
		"links": [],
		"github": "https://github.com/IEEE-NITK/Reinforcement-Learning"
	},
	{
		"Title": "Bike Sharing",
		"Abstract": "Bike Sharing project aimed to build a model that will predict the number of cycles used each day. The project used a SVR model. A webapp was also made which showed the prediction for the given input: date and weather conditions.",
		"links": [],
		"github": "https://github.com/IEEE-NITK/Ride-Sharing-Bike-Project"
	},
	{
		"Title": "Blockchain Free Cryptocurrency",
		"Abstract": "A Blockchain Free Cryptocurrency developed in the course of the project addresses the problem of centralization of the blockchain based networks currently in use. The cryptocurrency developed makes use of a transaction based hash graph for verification and validation which is a robust solution to the above problem.",
		"links": [],
		"github": "https://github.com/IEEE-NITK/Blockchain-free-cryptocurrency"
	},
	{
		"Title": "Generative Adversarial Networks",
		"Abstract": "Generative Adversarial Networks was a project tasked to study and apply the Generative Adversarial Network model to the image generation problem domain. The project comprised of two recent deep generative models – the Star GAN and the Triple GAN. The Star GAN tackles the unpaired image-to-image translation problem on a given label. A live demonstration. was provided where the user fed in an image of his face along with a parameter for the model to translate (hair color, in our case). This was fed in to a trained Star GAN model and the new image was returned. The Triple GAN focused on conditional image generation on labels learned during training in an unsupervised fashion. The model showed promising results on MNIST and CIFAR-10 for both image generation and unsupervised image classification tasks.",
		"links": [],
		"github": "https://github.com/IEEE-NITK/Generative-Adversarial-Networks"
	},
	{
		"Title": "Handwritten Equation Solver",
		"Abstract": "Handwritten Equation Solver was an application design to recognise and solve handwritten mathematical equations. The pipeline consisted of a front android application that captures the handwritten math equation which is then sent to a backend server for all computations and returns the solutions to the equation back to the android app. In the backend server, the image is pre-processed, and a DFS-based novel algorithm is used in the segmentation of the image. The segmented images are then passed through a Convolutional Neural Network (CNN) model for recognition. The model used was trained on a math symbol dataset and had achieved 98.88% cross validation accuracy. The spatial locality of the math symbols in the image is then used in the formation of the final equation string which is solved using the SymPy math engine.",
		"links": [],
		"github": "https://github.com/Handwritten-Equation-Solver/"
	}
]