{
    "title": "Embedathon",
    "date": "19th – 20th January 2019",
    "sig": "By CAS/SPS",
    "description": "IEEE – NITK conducted a 24 – hour hardware hackathon – “Embedathon”, on 19th – 20th January 2019. IEEE student members from Mangalore subsection, and first and second students from NITK were invited to participate in the event, in teams of 3. This was the first event of this kind conducted in NITK.<br> An online screening test was held on 14th January 2019. The test was hosted on Hackerearth. 59 teams participated in the screening test. The top 10 teams qualified to the main event, the hardware hackathon. The hackathon was held at Central Computer Centre (CCC), NITK. The event commenced at 1 pm on 19th January 2019. The problem statement required the participants to design a system to receive latitude, longitude and ocean temperature being transmitted by ships in the Arabian Sea using 433 MHz RF transmitters, and create a mobile application which could display this data in a graphical manner.<br> The participants were provided with all the components that they may require and were allowed to access the internet freely. Executive members from IEEE-NITK were present to give instructions and invigilate. Sufficient food and refreshments were provided to the participants who stayed up all night, working on the problem statement. The participants were judged based on the accuracy of data reception and the efficiency of their system. The winning team was “Hard Drivers” – Aaron Sequiera, Aditya Manjunath and Abhi Kalra.",
    "links": [
        {
            "title": "Facebook post",
            "url": "https://www.facebook.com/IEEENITK/posts/2019971831390910?__xts__[0]=68.ARBYLsUtdc3XkEpu6FeiQNHlBOAqwMOyxtdJsmn3ZIny6-mzzLlLgwat8jN-xwULozWAEWmxxVRn5Ge_YSOIUmInyVgXqngLAOh_TbZKtCqJUzK7xGOPrj4tCyz7yEbJcJYu5jN-XkXcBK0_i65LdR_PxWCZiHWaWynXbTMaPssSMItrc_uuH2Nx95xS5c8Oxz_Wvt9BXTfHAxDeM6HfzEXcxjr1oDvZc7bRo-JkAdKn8f7d_LjiQ7OOBDKmkB8bZjf4JjCQTCnwIKbeCbitp4rbikpqd7GHBdc01e-7LnlM0Axm5iNP6DlJ_SB5ki2fuDF0G08gx2pSmoTYUXpwtSMKcA&__tn__=-R"
        }
    ]
}