{
    "2019" : [
        {
            "Title": "Analysis of Air Breathing Gas Turbine",
            "year":"2018 - 2019",
            "image":"res/img/placeh.jpg",
            "Abstract": "This project is aimed to  study all types of contemporary air-breathing, compressor - gas turbine coupled aircraft engines, especially the TurboFan and the TurboProp, and to determine which engine is best suited to a given scenario, based on its BPR (Bypass Ratios).",
            "links": []
        },

        {
            "Title": "Design and Study of Chevron Nozzles",
            "year":"2018 - 2019",
            "image":"res/img/placeh.jpg",
            "Abstract": "The aim of this project will be to simulate exhaust from a traditional round nozzle and a chevron nozzle, at various exhaust speeds, and study the pressure variances produced.",
            "links": []
        },
        
        {
            "Title": "Four Bar Plotter V2",
            "year":"2018 - 2019",
            "image":"res/img/placeh.jpg",
            "Abstract": "4 Bar plotter is a mechanism designed to plot any given figure or shape on a plane sheet of paper using a four bar mechanism. This project aims to utilize the existing 4BarPlotter mechanism and automate it. ",
            "links": []
        },

        {
            "Title": "Electromagnetic Desalination",
            "year":"2018 - 2019",
            "image":"res/img/placeh.jpg",
            "Abstract": "A theoretical model is to be developed for electromagnetic-mechanical salt removal process and solved numerically to investigate the optimum parameters for separation. The fluid flow are modelled using CFD software ANSYS FLUENT.",
            "links": []
        },

        {
            "Title": "Design and Optimization of Tesla Valve",
            "year":"2018 - 2019",
            "image":"res/img/placeh.jpg",
            "Abstract": "This project aims to minimize the leakage in a TESLA VALVE by making slight changes in design. CFD is the perfect tool to not only measure device’s effectiveness but also to understand the working. So, aim of the project is to optimize design of Tesla valve using CFD tools.",
            "links": []
        },

        {
            "Title": "Design of Algorithm to Capture Shocks in Compressible Flow",
            "year":"2018 - 2019",
            "image":"res/img/placeh.jpg",
            "Abstract": "Capturing shocks in CFD using commercially available CFD software is not possible. A new methodology using finite differences has to be developed to solve for such flows. The shock-capturing filtering is written in its conservative form, and its magnitude is determined dynamically from the flow solutions.",
            "links": []
        },

        {
            "Title": "Imitation Learning to Detect Unusual Activity",
            "year":"2018 - 2019",
            "image":"res/img/placeh.jpg",
            "Abstract": "This project aims at training a deep learning model to detect any form of unusual activity, like kidnapping by studying closely the regular pattern and finding any irregularities, or by feeding datasets of what is defined as unusual and teaching it to identify the same.",
            "links": []
        },

        {
            "Title": "Analysing The Impact Of Increasing Reinforcement Material Content In The Composites Used To Design Nose of ICBM ",
            "year":"2018 - 2019",
            "image":"res/img/placeh.jpg",
            "Abstract": "This project will involve designing of these composites with increasing amounts of carbon fibre, modelling the nose cone and conducting a thermal analysis.",
            "links": []
        },

        {
            "Title": "Auto Pilot",
            "year":"2018 - 2019",
            "image":"res/img/placeh.jpg",
            "Abstract": "This drone will use image processing and road detection on OpenCV and deep learning to train a model that can help the drone navigate itself on pre fixed routes as well as GPS routes using Neural Networks.",
            "links": []
        }
    ],

    "2018" : [
        {
            "Title": "Photocatalytic Degradation of Reactive dyes using PANI AgTiO2",
            "year":"",
            "image":"res/img/placeh.jpg",
            "Abstract": "The textile dyeing industry consumes large quantities of water and produces large volumes of wastewater from different steps in the dyeing and finishing processes.Wastewater from printing and dyeing units is often rich in color, containing residues of reactive dyes and chemicals, At present, the dyes are mainly aromatic and heterocyclic compounds, with color display groups and polar groups.Therefore, understanding and developing effective printing dye industrial wastewater treatment technology is environmentally important. If a textile mill discharges the wastewater into the local environment without any treatment, it will has a serious impact on natural water bodies and land in the surrounding area.Objectives: The broad objective of this project is to study the photocatalytic efficacy of free and immobilized Ag TiO2 nanoparticles and Ag TiO2 / PANI nanocomposites for degradation of dye waste water under solar light irradiation.Specific objectives include: To synthesize and characterize Ag TiO2 nanoparticles and Ag TiO2 / PANI nanocomposites. To investigate the efficacy of Ag TiO2 nanoparticles in suspended dye water and degradation by photocatalysis under solar light radiation.To study the effect of different factors such as the weight percentage of Ag @TiO2 nanoparticles in Ag TiO2 / PANI nanocomposites, catalyst loading and initial dye concentration on photocatalyticdegradation by Ag TiO2 / PANI nanocomposites, To study the degradation under various conditions like pH, dye concentration, catalyst loading, different time durations etc. ",
            "links": []
        },

        {
            "Title": "Extending the use of eddy current testing on non-conductive components",
            "year":"",
            "image":"res/img/placeh.jpg",
            "Abstract": "Failure analysis is the process of collecting and analyzing data to determine the cause of a failure, often with the goal of determining corrective actions or liability.Eddy - current testing(ECT) is one of the many electromagnetic testing methods used in non - destructive testing(NDT) making use of electromagnetic induction to detect and characterize surface and sub - surface flaws in conductive materials.This method is sensitive to small cracks and other defects like surface and near surface defects.For this, minimum part preparation is required.But despite so many advantages of ECT, one of the limitations of this testing method is that only conductive materials can be inspected.In this analytical project, extended use of ECT method for non - conductors is discussed and a possible route of approach is stated.An electrically conductive liquid like PVDF mixed with fillers such as FeCl3 and MnCl2 is coated on a non - conductor to test the possibility of this approach. ",
            "links": []
        },

        {
            "Title": "Mounting of a vertical axis Darrieus wind turbine on a boat for energy harvesting",
            "year":"",
            "image":"res/img/placeh.jpg",
            "Abstract": "The increasing use of fossil fuels in the recent decades has caused a lot of environmental problems like climate change and global warming.The use of sustainable and renewable energy is growing since the past decade to provide cleaner energy to society.Wind energy is considered to be one of the best sources of renewable energy due to its availability in abundance.The current project focuses on harnessing wind energy by installing a vertical axis Darrieus turbine on a boat.A CFD approach will be chosen to do the analysis and calculations. The advantages of using a Darrieus turbine is that wind from any direction can be harnessed, which is suitable when boats sail in oceans.The harnessed energy can be used to power different systems in the boat like the Navigation, Electronic, and Lighting etc.         ",
            "links": []
        },

        {
            "Title": "Computational study of a vertical axis wind turbine mounted along the highway",
            "year":"",
            "image":"res/img/placeh.jpg",
            "Abstract": "Use of renewable energy to meet the global energy requirement is a growing area of concern This problem requires immediate attention in wake of excessive pollution caused b conventional sources of energy and their impact on the environment.In particular one of th main sources of pollution is harmful gases emitted by power plants.Wind energy is one of th most reliable abundant and cheap sources of renewable energy.The current project focuses o harvesting wind generated by the low pressure created by the vehicles as they move on th highway from a vertical axis turbine.The advantages of using a vertical axis wind turbine is tha it can operate even when there is small wind also wind in any direction can be used to harnes energy.This energy generated can be stored and use for street lights hoardings etc.A CF analysis of the turbine would be carried out ",
            "links": []
        },

        {
            "Title": "Positive drive continuously variable transmission (P-CVT)",
            "year":"",
            "image":"res/img/placeh.jpg",
            "Abstract": "A continuously variable transmission (CVT) is an automatic transmission that can change seamlessly through a continuous range of effective gear ratios.This contrasts with other mechanical transmissions that offer a fixed number of gear ratios.A belt - driven design offers approximately 88 % efficiency, which, while lower than that of a manual transmission, can be offset by lower production cost and by enabling the engine to run at its most efficient speed for a range of output speeds.When power is more important than economy, the ratio of the CVT can be changed to allow the engine to turn at the RPM at which it produces greatest power. This is typically higher than the RPM that achieves peak efficiency.In low - mass low - torque applications a belt driven CVT also offers ease of use and mechanical simplicity.But still these clutches aren’ t widespread because they offer infinite effective gear ratios between two particular gear ratios and these two gear ratios aren’ t very different and thus CVTs cannot be used in automobiles requiring high torque.So, the aim of this project is to make use of the best properties of a CVT and enable this type of transmission to be incorporated in heavy vehicles. For this, the intention is to use a tubes which will effectively vary the diameter once the air is forced in or out and thus increasing the two gear ratios between which the CVT operates. ",
            "links": []
        },

        {
            "Title": "Smart Electromagnetic Clutch for Automobiles",
            "year":"",
            "image":"res/img/placeh.jpg",
            "Abstract": "Electromagnetic clutches operate electrically but transmit torque mechanically. Compared to other clutch systems electromagnetic clutches have maximum torque transferring capacity and these are most suitable for remote operation since no mechanical linkages are required to control their engagement, providing fast, smooth operation.But still these clutches aren & #39;t used because of enormous heat generation which limits the maximum operating temperature and cannot be used in high speed application. So, the aim of this project is to make use of the best properties of an electromagnetic clutch and manual transmission and combine it to make an semi automatic transmission in a unique way which isn’t in the market and which will reduce the high initial expenditure for these clutches and also enable these clutches to be used in high speed applications. For this, the intention is to use a switch to detect when the gears have to be changed which along with a customized RC circuit will help in automatically disengaging the clutch and re-engaging clutches for different gears, hence removing the need for the clutch pedal.",
            "links": []
        },

        {
            "Title": "Performance analysis of a baffle plate heat exchanger using hybrid nano fluids",
            "year":"",
            "image":"res/img/placeh.jpg",
            "Abstract": "Heat exchangers are one of the most widely used equipment in process industries. Heat exchangers are used to transfer heat between two process streams. A typical heat exchanger, usually for higher pressure applications is the shell and tube heat exchanger. Baffles are used to support the tubes for structural rigidity, preventing tube vibration and sagging and to divert the flow across the bundle to obtain a higher heat transfer coefficient. This project aims to determine the optimum baffle angle for effective heat transfer performance in a heat exchanger. The fluids used for the analysis would include vanadium and grapheme bases nano fluids, water+ Titanium oxide fluid and water. Additionally the effect of vortex generators at the entrance of the heat exchangers would be investigated to study the heat transfer performance with and without vortex generators. A vented cylinder vortex generator would be used at the entrance to study the turbulence effect. The heat transfer performance will be studied by using alumina hybrid nanofluid as the cooling fluid. The pressure drop, nusselt number, temperature and heat transfer coefficient would be calculated for each of the angle variations to determine the optimum angle for enhanced performance. Also the use of non Newtonian fluids would be investigated to study how different non Newtonian fluids are in terms of heat transfer performance. The heat transfer performance would be investigated by considering the cooling fluid to be both Newtonian and non-Newtonian. Power law scheme would be used for non-Newtonian fluid modelling. The major design parameters are baffle spacing, shell diameter, tube diameter and length. In general, conventional shell and tube heat exchangers result in high shell-side pressure drop and formation of recirculation zones near the baffles. The analysis will be validated through analytical calculations. The design would be done in CATIA and the analysis in FLUENT. The results will be validated against experimental data. A shell and tube heat exchanger will be built for this purpose and the temperature time plots will be generated for each case.",
            "links": []
        }, 
        {
            "Title": "Deck mounted vertical axis wind turbine for wind energy harvesting on cruising boat",
            "year":"",
            "image":"res/img/placeh.jpg",
            "Abstract": "Energy has been the root of all development in all walks of life. In recent years, the world has witnessed a drastic increase in the use of energy resources in the course of development. Unfortunately, fossil fuels, which have been primary sources of energy are fast depleting and there is no need to explore for new forms of energy resources. There are a large number of energy sources that are not tapped to their maximum potential, like solar, wind, geothermal,tidal etc. Wind currents on sea is one such source. Typical wind speeds in bay of bengal range from 8 to 20 knots, mostly north - East and Eastward in direction. Further added to this, general speed of sailing boats is around 6-9 knots. Added to this, pollution is one of the serious concerns, currently. If a decent amount of energy is captured from these breezes, the usage of fossil fuels in boats can be cut down to some extent. The purpose of this study is to consider the use of wind energy to supply power to boats along with the conventional energy sources. A H-type vertical axis Darrieus turbine is mounted on the hull of a boat to harness the wind energy.",
            "links": []
        }, 
        {
            "Title": "Implementing simultaneous localisation and mapping on turtlebot using ROS",
            "year":"",
            "image":"res/img/placeh.jpg",
            "Abstract": "The aim of this project is to implement the Bayesian SLAM algorithm on a Turtlebot. SLAM stands for Simultaneous Localization and Mapping. It enables a mechatronic vehicle to be placed in an unknown environment, map it's surroundings and traverse the generated map autonomously. The robotic vehicle used is a Turtlebot 2 with a Microsoft Kinect sensor as the main sensor array. The Turtlebot runs ROS, or Robotics Operating System which is an open source Operating System which is a collection of tools, libraries, and conventions that aim to simplify the task of creating complex and robust robot behavior across a wide variety of robotic platforms. ROS is used here to implement the gmapping and amcl packages on the Turtlebot 2 which enables it to autonomously map and navigate in its environment.",
            "links": []
        }, 
        {
            "Title": "Energy efficient and energy sufficient houses",
            "year":"",
            "image":"res/img/placeh.jpg",
            "Abstract": "If you plan to design and build a new home or do an extensive remodel on an existing house, optimizing home energy efficiency requires a whole-house systems approach to ensure that you and your team of building professionals consider all the variables, details, and interactions that affect energy use in your home. In addition to occupant behavior, site conditions, and climate, these include: Appliances and home electronics, Insulation and air sealing, Lighting and daylighting, Space heating and cooling, Water heating, Windows, doors, and skylights. Before making upgrades, you may also want to work with an energy auditor to use the Home Energy Score, which provides a rating of your home’s current efficiency, as well as a list of improvements and potential savings.",
            "links": []
        }
    ]
}
